import 'package:ilri/models/course.dart';

List<Course> courseData = [
  Course(
      coverImage: 'assets/images/img_2.png',
      title: 'የቤተሰብ ስርዓተ ምግብ',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                """የምትመለከቷቸዉ አራቱ ሕጻናት በእኩል እድሜ ቢኖራቸዉም በስርዓተ ምግባቸዉ የተለያዩ ናቸዉ፡፡ ሕጻን ሐ ብቻ ነዉ ጤናማ ልጅ  
ህጻን ሀ:- የመነመነ፥በጣም የከሳ ነው
ህጻን ለ:- የቀነጨረ፥በጣም የከሳ ነው
ህጻን ሐ:- የተስተካከለ ነው
ህጻን መ:- በጣም የወፈረ ነው
                """,
            image: 'assets/images/img_3.png'),
        CoursePage(
            description:
                'በአመጋገብ የተጎዳች ነብሰ ጡር እናት አነስተኛ ክብደት ያላት ህጻን ትወልዳለች፡፡ ይች ደካማ አስተዳደግ ያላት ልጅ ወደፊት አነስተኛ ክብት ያለዉ ልጅ ተወልዳለች፡፡',
            image: 'assets/images/imag_4.png'),
        CoursePage(
            description:
                'በአግባቡ የተመገበች ነብሰ ጡር እናት ጤናማ ህጻን ትወልዳለች፡፡ ይች ልጅ ጤናማ ሆና ታድግና ወደፊት የተስተካከለ ጤና ያለዉ ልጅ ተወልዳለች፡፡ ',
            image: 'assets/images/img_5.png'),
        CoursePage(
            description:
                '2 የምግብ አይነት የያዘ መሶብ፡ እንጀራና ሽሮ፡፡ ይህ መሶብ የተመጣጠነ እንዲሆን ሌሎች ምግቦች መጨመር አለባቸዉ',
            image: 'assets/images/img_6.png'),
        CoursePage(
            description:
                '5 የምግብ አይነት የያዘ መሶብ፡ እንጀራና (የጤፍ) ዶሮ (ከእንስሳት) የጓሮ አትክልት፤ ሽሮ እና ፍራፍሬ',
            image: 'assets/images/img_7.png'),
        CoursePage(
            description:
                'በየቀኑ እነዚህን 6 ቱን የምግብ አይነቶች ይመገቡ። ካላመረቱ የተመጣጠነ ምግብ ይመገቡ።',
            image: 'assets/images/img_1.png'),
        CoursePage(
            description:
                'የተስተካከለ ስርዓተ ምግብ የሚመገቡ ህጻናት በትምህርታችው ጎበዝ ጤናማና ዘወትር ትምህርት ቤት የሚገኙ ናቸው',
            image: 'assets/images/img_8.png'),
        CoursePage(
            description: 'ምግብ ለግብርናችን ሃይል ይስጣል',
            image: 'assets/images/img_9.png'),
        CoursePage(
            description:
                'ሁልጊዜም በተቆፈረ መፀዳጃ ቤት ይጠቀሙ፥፥ ሲመለሱ አጅወን በውሃና በሳሙና ይታጠቡ፥፥ ምግብን ሁሌም ከድነው በማስቀመጥ አንደ አይጥና ዝንብ ከመሳሰሉት በሽታ አስተላላፊ ተሃዋሲያን ይከላከሉ',
            image: 'assets/images/img_10.png'),
        CoursePage(description: """የስርዓተ ምግብ መልክቶች
- የተመጣጠነ እና የተሰባጠረ ምግብ ይመገቡ
- የስኳር ጨውና ዘይት መጠን ይቀንሱ
- ፕሮቲን ምግቦችን ይመገቡ
- ዘወትር ጥሩ ቁርስ መመገብ ልምድ ያድርጉ
- እጅዎትን በውሃና በሳሙና ዘወትር ለ 60 ሴኮንድ ያህል ይታጠቡ	
- በቂ የሆነ እና ፈልቶ የቀዘቀዘ ዉሃ ይጠጡ
ዘወትር የአካል ብቃት እንቅስቃሴ ማድረግ ዘወትር ስፖርታዊ እንቅስቃሴ ማድረግ የደም ዝውውርን ያስተካክላል፡ ጭንቀትን ይቀንሳል፡ ሀይል ይሰጣል፡ ጤናማ ያደርጋል፡፡ በመሆኑም በየቀኑ ከ 30-60 ደቂቃ ጊዜ የሚሆን የአካል ብቃት አእንቅስቃሴ አድርጉ፡፡
- በቂ የአካል ብቃት እንቅስቃሴ ማድረግ
- ቀላል ስፖርት መስራት
- ቤት ውስጥ የፈጠራ ስራ መስራት
- አትክልት መንከባከብ
- ዘወትር በእግር መጓዝ፡ ብስክሌት መጋለብ
- ከሱቅ እቃ መግዛት
""", image: 'assets/images/image1161.png'),
        CoursePage(description: """በየቀኑ በቂ አትክልትና ፍራፍሬ መመገባችሁን እርግጠኛ ሁኑ
አትክልትና ፍራፍሬ የቫይታሚንና ማዕድናት ምንጮች ናቸው፡፡
ከዚህ በተጨማሪም አትክልትና ፍራፍሬ ዋናዎቹ የፋይቨር ምንጮችም ናቸው፡፡በአትክልትና ፍራፍሬ ውስጥ የሚገኙ  የቫይታሚንና ማዕድናት በሽታ የመከላከል አቅማችንን ያዳብራሉ፡፡
""", image: 'assets/images/image37.png'),
        CoursePage(
            description: 'አትክልቶችና ጥቅሞቻቸው', image: 'assets/images/image38.png'),
        CoursePage(description: '', image: 'assets/images/image39.png'),
        CoursePage(
            description: 'ፍራፍሬዎችና ጥቅሞቻቸው', image: 'assets/images/image40.png'),
        CoursePage(description: '', image: 'assets/images/image41.png'),
        CoursePage(description: """ቀናችሁን በጥሩ ቁርስ ጀምሩ
ሁል ጊዜ ቀኑን በተመጣጠነና በጤናማ ቁርስ ስንጀምር ሰዉነታችን የዕለት ከዕለት ተግባሩን ለማከናወን በቂ ሀይልና ጉልበት ያገኛል፡፡ ይህ ሀይልና ጉልበት ከምንመገበው ምግብ ይመጣል፡፡ ቁርሳችን የተመጣጠነ ምግብ ተመገብንn ለማለት የግድ የእንስሳት ተዋፅኦ ምግባችን ላይ መጨመር አለብን፡፡
""", image: 'assets/images/image42.png'),
        CoursePage(
            description:
                'የጤናማ ቁርስ ምሳሌዎችን ከታች ይመልከቱ ቤተሰቡ የተለያየ ቁርሶችን በማዘጋጀት እንዲሳተፍ ማድረግ ለመላው ቤተሰብ የፈጠራ እና የመደጋገፍ መንፈስን ይገነባል፡፡',
            image: 'assets/images/image43.png'),
        CoursePage(description: """የቁርስ ጥቅም
ከ 7-12 አመት አእድሜ ላላቸው ህጻናት የሃይል ፍላጎት በቀን ከ 1600-2200 kcaL ነው፡፡ ልጆች የእለት ተዕለት ተግባራቸዉን ለማከናወን በቂ ጉልበት እንዲኖራቸው ለማድረግ ቁርስ በቀን እንዲያገኙት ከሚጠበቀዉ መጠን ዉስጥ ክ 15-30% ይይዛል፡፡  
የተለያዩ የልጆች እንቅስቃሴ በየቀኑ በቂ ካሎሪ ይፈልጋል፡፡ ቁርስ የቀኑ  የመጀመሪያ ምግብ እንደመሆኑ መጠን ለወንዶች እና ልጃገረዶች አስፈላጊ ነው፡፡ ምንም እንኳን በተለያየ መጠን እንደ ልጆች ክብደት እና የዕለት ከዕለት እንቅስቃሴ የተለያየ ቢሆንም፡፡
በቤት ዉስጥ ጤናማ ምግቦችን ማዘጋጀት እና መመገብ የልጆችን በሽታ የመከላከል አቅም ሊደግፍ እና በየቀኑ የሀይል ፍላጎታቸውን ሊያሟላ ይችላል፡፡ ጤናማ ልጆች እንዲኖሩን ጤናማ አመጋገብ ተግባራዊ እናድርግ፡፡ 
አስታዉሱ
የሰውነት ድርቀትን ለመከላከል በቂ ውሃ መጠጣት አለባችሁ!! 
""", image: 'assets/images/image44.png'),
        CoursePage(description: """በምግብ ዝግጅት ጊዜ መወሰድ ያለባቸው የንጽህና ጥንቃቄዎች
ጤናማ እና የተመጣጠነ ምግብ ለጤና አስፈላጊ እንደሆነ ሁሉ የምግብ ንጽህናን መጠበቅም እንደ መርህ መከተል አለብን፡፡ የሚከተሉትን ተግባራዊ አድርጉ
- የማዕድ ቤት እቃዎች እና ሌሎች የመመገቢያ እቃዎች ንጹህ መሆናቸውን ያረጋግጡ፡፡
- ምግብ የሚያበስሉበት ቦታ ከቆሻሻ ንጹህ መሆኑን፡ ከአይጦች፡ ከእንሽላሊቶች፡ ከበረሮዎች የጸዳ መሆኑን ያረጋግጡ፡፡
- የመጥበሻ ዘይት ከሁለት ጊዜ በላይ አትጠቀሙ፡፡ ሁሌም አዲስ ዘይት ተጠቀሙ፡፡
- አርቴፊሻል ማጣፈጫዎችን ከመጠቀም በመቆጠብ ጨው፡ ስኳር፡ እና በርበሬ ተጠቀሙ፡፡
""", image: 'assets/images/image1161.png'),
        CoursePage(
            description: 'የምግብ ዝግጅት የጥንቃቄ መስፈርቶች',
            image: 'assets/images/image45.png'),
        CoursePage(description: """ምግብ በምናበስልብት ጊዜ መዉስድ ያለብን ጥንቃቄ
በቤት ውስጥ እና ውጭ የምናደርጋቸው እንቅስቃሴዎቻችን ከተለያዩ ቦታዎቸ ለሚመጡ ጀርሞች እና ተሃዋሲያን ተጋላጭ ያደርጉናል፡፡ ይህን ለመከላከል ማድ ቤታችን ከጭስ፡ ከቆሻሻና ከተባይ የጸዳ መሆን አለበት፡፡
ምግብ በሚበሰልበት ጊዜ የሚከተሉት ጥንቃቄዎች መወሰድ አለባቸው
""", image: 'assets/images/image46.png'),
        CoursePage(description: """
        የእንቁላል እውነታዎች

1. እንቁላል ለዓይንዎ ጥሩ ነው፡፡ የዓይን ሞራ ግርዶሽ እና የጡንቻ መበላሸትን የሚከላከል ሉቲን ይይዛሉ፡፡
2. የእንቁላል ቅርፊት እስከ 17,000 የሚደርሱ ቀዳዳዎች ሊኖሩት ይችላል።
3. የእንቁላል ቅርፊት እና ቢጫ ቀለም ሊለያዩ ይችላሉ ነገር ግን በጣዕም እና በጥራት ላይ ምንም ተጽእኖ አይኖራቸውም፡፡
4. የዶሮ ዝርያ የእንቁላል ለምን ይወስናል፡፡ አንዳንድ ዝርያዎች ሰማያዊ, አረንጓዴ ወይም ሮዝ እንቁላል ሊጥሉ ይችላሉ፡፡
5. የእንቁላል አስኳል በተፈጥሮ ቫይታሚን ዲ ከያዙ ጥቂት ምግቦች ውስጥ አንዱ ነው።
6. ቡናማ እንቁላሎች በብዙዎች ዘንድ ተመራጭ ናቸው፡፡ 
7. እንቁላል በኮሊን የበለፀገ ሲሆን ይህም መደበኛ የሕዋስ እንቅስቃሴን ያበረታታል።
8. በጥሬ እንቁላል እና በጠንካራ የበሰለ እንቁላል መካከል ያለውን ልዩነት ለመለየት ያሽከርክሩት ጠንካራ የበሰለ እንቁላሎች በቀላሉ ይሽከረከራሉ፡፡
9. መሬት ላይ የተጣለን እንቁላል በቀላሉ ለማጽዳት በጨው ይሹት።
10. እንቁላሎች  በቤት ውስጥ በሙቀት በአንድ ቀን ብናስቀምጣቸው በአንድ ሳምንት ማቀዝቀዣ ከማስቀመጥ የበለጠ ያረጃሉ፡፡
11. አንድ የተሻሻለች ዶሮ በዓመት ከ 300 እስከ 325 እንቁላል ትጥላለች፡፡
12. ዶሮ እንቁላል ለማምረት ከ 24 እስከ 26 ሰአታት ይወስድባታል፡፡
13. ዶሮዎች ሲያረጁ እንቁላሎቻቸው ትልልቅ ይሆናሉ፡፡

እንቁላል መመገብ የሚሰጠው ጥቅም
እንቁላል ጤናማ ከሆኑ የፕሮቲን ምንጮች አንዱ እንደሆነ ጥርጥር የለውም። እንቁላልን ቀቅለን ወይም፣ ጠብሰን፣ ብንመገበው የተሟላ የፕሮቲን ምንጭነቱን አይለቅም፡፡ 7 ግራም ፕሮቲን የያዘ እንቁላል ብንመገብ 75 ካሎሪ ሃይል እናገኛለን፡፡ ይህ ብቻ አይደለም፣ አንድ እንቁላል ብረት፣ በርካታ ማዕድናት እና ቫይታሚኖች እንዲሁም 5 ግራም ስብ ይዟል። 
ሌሎች የእንቁላል ጥቅሞች ከዚህ በታች ተዘርዝረዋል፡፡

ከመጠን ያለፈን ክብደት ለመቀነስ ይረዳል
እንቁላል የፕሮቲን እና የስብ ጥምር የሆነ ኃይለኛ ምግብ ነው። እንቁላልን በየቀኑ መመገብ ከመጠን ያለፈ ክብደትን ለመቀነስ ይረዳል፡፡ 

በሽታ የመከላከል አቅምን ይጨምራል
በቂ ጉልበት ከሚሰጡት እና በቀላሉ ሊዘጋጁ ከሚችሉት ርካሽ ምግቦች አንዱ እንቁላል ነው። የእንቁላል አስኳል ቫይታሚን ዲ እንደያዘ ይታወቃል፡፡ ይህም ከጉንፋን እና ተዛማጅ በሽታዎች በፍጥነት እንዲያገግሙ ይረዳዎታል። በተጨማሪም የሰውነትን ጤንነት ለመጠበቅ አስፈላጊ የሆኑ የተለያዩ ማዕድናት እና ቫይታሚኖች ስላሉት በሽታ የመከላከልን አቅምን ከፍ የሚያደርግ የምግብ አይነት ነው።

የአእምሮ ጤናን ይጨምራል

እንቁላል, በየቀኑ መመገብ አእምሮ የሚያስፈልጉትን ሁሉንም ንጥረ ነገሮች ስለሚይዝ የእውቀት (ኮግኒቲቭ) ጤናን ያሻሽላል፡፡ ቫይታሚኖች B12, B6, Choline እና Folate በውስጡ የያዘ ነው፡፡ እነዚህ ንጥረ ነገሮች የአንድን ሰው ስሜት እና ትውስታ ይቆጣጠራሉ፡፡ በተጨማሪም እንቁላል በየቀኑ ከሚመከረው የ choline መጠን ውስጥ 26 በመቶውን ይይዛል።

ቆዳን ጤናማ ያደርጋል

ሴሊኒየም ለቆዳ ጤንነት አስፈላጊ አካል ሲሆን እንቁላሎች የዚህ ንጥረ ነገር ምንጭ ናቸው፡፡ አንድ ትልቅ እንቁላል በየቀኑ መመገብ በቀን መወሰድ ከሚኖረበት የሴሊኒየም መጠን 28 በመቶ ይይዛል። እንቁላል በየቀኑ ሲመገቡ ቆዳዎን ጤናማ ያደርገዋል፡፡ 

መቀንጨርን ይቀንሳል

እንቁላል በማንኛውም መልኩ የሕፃናት የእለት ተእለት አመጋገብ አካል ሲሆን ለእድገት ጠቃሚ የሆኑ ንጥረ ነገሮች ምንጭ በመሆኑ መቀንጨርን ለመከላከል ከሚረዱት በጣም ርካሽ ምግቦች ውስጥ አንዱ ነው፡፡ ወይዘሮ ኢአኖቲ በኢኳዶር ባደረጉት ጥናት ለአንድ ልጅ በቀን እንቁላል መመገብ የመቀምምምምነጨርን ስርጭት በ47 በመቶ እንደሚቀንስ አረጋግጠዋል፡፡
""", image: 'assets/images/image1157.jpeg')
      ]),
  Course(
      title: 'የዶሮ እና የአትክልት ገንፎ አዘገጃጀት',
      coverImage: 'assets/images/image47.png',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(description: """አንዴ የምንመገበው የዶሮ ስጋ ንጥረ ነገር ይዘት
- 485 ካሎሪዎች
- 32 ግ ስብ
- 24 ግ ካርቦሃይድሬት
- 29 ግ ፕሮቲን

ለ 10 ምግብ የሚሆን ግብዓት
- 3 ድፍን ነጭ ሽንኩርት
- 3 ቀይ ሽንኩርት
- 1 የሻይ ማንኪያ ቅርንፉድ
- 4 ሻማዎች
- 2 ሴሜ በርበሬ
- 2 ሴሜ ጅንጅብል
- 2 የሾርባ ማንኪያ የሎሚ ቅጠል
- 3 የሎሚ ቅጠሎች
- 250 ግራም የዶሮ ስጋ 750 ግራም ነጭ ሩዝ  2 የሻይ ማንኪያ ጨው
- 200 ግራም ካሮት
- 200 ግራም የተፈጨ ባቄላ
- 1 የሻየ ማንኪያ በርበሬ 
- 50 ግራም እንቁላል 
- ፍራፍሬ
- 650 ግራም ፍራፍሬ

አዘገጃጀት:
የቀቀሉትን የዶሮ ስጋ ለሁለት ይከፋፍሉት፡ ግማሹን ለሾርባ የቀረውን ለገንፎ እንዲሆን፡፡ 
ሩዙን ያብስሉ፡፡ በበሰለው የዶሮ ስጋ ላይ  ጨው እና ቅጠላ ቅጠሎችን ይጨምሩ፡፡ ገንፎ እስኪሆን ድረስ ማማሰሉን ይቀጥሉ፡፡ ከዚያም ካሮቱን እና አረንጓዴ ባቄላዎችን ይቀቅሉ፡፡ አትክልቶቹ በሳቱ እንዳይጎድ እሳቱን ያጥፉ፡፡ የበሰለውን ሩዝ፡ የዶሮ ስጋ፡ አትክልት፡ ከተቁላላው ሽንኩርትና ዘይት ላይ በመጨመር ገንፎ እስኪሆን በማማሰል ያዘጋጁ፡፡
 ለሾርባ የቀረውን ስጋ በቅመማ ቅመሞች ማብሰል፡፡ ጨው፡ በርበሬ እና የተከተፈ ነጭ ሽንኩርት ይጨምሩ፡፡  በተዘጋጀው ሾርባ ላይ   የተቀቀለ እና የተላጠ እንቁላል ይጨምሩ፡፡ ተዘጋጅቶ እንዳለቀ ልጅዎን እና ሌሎች ቤተሰብዎን ይመግቡ፡፡
""", image: 'assets/images/image47.png'),
        CoursePage(description: """
      የበሰለ ሩዝ በአትክልት ከዕንቁላል ጋር ለመመገብ አዘገጃጀት
ለ 10 ምግብ የሚሆን ግብዓት
ግብዓቶች
ሩዝ በአትክልት ለማዘጋጀት:
250 ግ ማሽላ
250 ግ ካሮት
5 ራስ ቅርንፉድ
3 ራስ ነጭ ሽንኩርት
5 ፍሬ ቀይ ቃሪያ
 1 የሻይ ማንኪያ በርበሬ
1 የሻይ ማንኪያ ጨው
3 የሻይ ማንኪያ የአትክልት ዘይት
1.5 ኪግ የበሰለ ሩዝ
3 ራስ ቀይ ሽንኩርት

እንቁላል:
10 እንቁላሎች
3 የሻይ ማንኪያ የአትክልት ዘይት

ፍራፍሬ:
500 ግ ሙዝ (10 ራስ ሙዝ)


አዘገጃጀት
ሩዝ በአትክልት ለማዘጋጀት
    1. ሩዙን በሚገባ በማጠብ ያጥልሉት::
    2. ካሮቱን በማጠብ በትናንሹ ይቁረጡት::
    3. ነጭ ሽንኩርቱን ቃሪያዉንና ጨውን ቀላቅለው ይፍጩት፡፡
    4. ዘይትና ቅመሞችን ይጨምሩበት::
    5. የተፈጨውን አትክልት ይጨምሩበት::
    6. ሩዙን በመቀላቀል ከተፈጨው ቃሪያ ሽንኩርትና ጨዉ ጋር ይቀላቅሉት::
    7. ሩዙ እስኪበስል በደንብ ያማስሉት::
    8. ከእንቁላሉ ጋር ቀላቅለው ያቅርቡት::

እንቁላሉን ለማዘጋጀት
    1. ዘይት ያቁላሉ::
    2. እንቁላሉን በጥንቃቄ ይስበሩ::
    3. በሚገባ ያብስሉት, ከዛም ከሩዙ ጋር ቀላቅለው ያቅርቡት፡
""", image: 'assets/images/image1157.jpeg')
      ]),
  Course(
      title: 'የምግብ ጥቅም',
      coverImage: 'assets/images/image105.png',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                """የተመጣጠነ ምግብ ለሰውነታችን አስፈላጊ የሆኑትን ንጥረ ነገሮች በሙሉ በትክክለኛው መጠን ማካተት አለበት፡፡ የምንመገበው ምግብ የተለያየ እና ሚዛናዊ በሆነ መጠን ሰውነታችን የእለት ከዕለት ፍላጎታችንን የማሟላት እድሉ ሰፊ ይሆናል፡፡
የተመጣጠነ አመጋገብ ከአምስት የምግብ አይነቶች (ከፍራፍሬዎች፡ ከአትክልቶች፡ ከጥራጥሬዎች፡ ከፕሮቲን ምግቦች እና ከወተት ተዋጽኦዎች)የተውጣጡ ምግቦችን ያካትታል፡፡  የተመጣጠነ ምግብ መመገብ ሰዎች ጤናቸውን እንዲጠብቁ እና ለበሽታ የመጋለጥ እድላቸውን እንዲቀንስ ይረዳል።
ሶስቱ የምግብ ጥቅሞች:-
1. ገንቢ ምግቦች
2. ሃይል ሰጭ ምግቦች 
3. በሽታ ተከላካይ ምግቦች
          """,
            image: ''),
        CoursePage(description: """ገንቢ ምግቦች

በአጠቃላይ ከፍተኛ የፕሮቲን ይዘት ያላቸው ምግቦች እንደ ሰውነት ግንባታ ምግቦች ይቆጠራሉ። ስጋ፣ የዶሮ እንቁላል እና ስጋ፡ ዓሳ፡ የተፈጨ የበሬ ሥጋ፣ የአሳማ ሥጋ፣ ሳልሞን፣ ቲላፒያ፡፡ የወተት ተዋጽኦዎች፡ እርጎ፣ አነስተኛ ቅባት ያለው ወተት እና አይብ። እንዲሁም የአእል ዘሮች እንደ ዳቦ፣  ብስኩቶች፣ ፈንድሻ እና ሩዝ።  
""", image: 'assets/images/image99.jpg'),
        CoursePage(description: """ሃይል ሰጭ ምግቦች
        
ሁሉም ምግቦች ኃይል ይሰጣሉ፡፡ በካርቦሃይድሬት እና በስብ የበለፀጉ ምግቦች በአጠቃላይ ሃይል ሰጪ ምግቦች ተደርገው ይወሰዳሉ። ሃይል ሰጪ ምግቦች ከተፈጩ በኋላ ስራን ለማከናወን ለሰውነታቸውን ሃይል የሚያቀርቡ ናቸው። 
ከሌሎቹ የምግብ ዓይነቶች በአንፃራዊነት ከፍተኛ የስኳር ይዘት አላቸው። 
የኃይል ሰጪ ምግብ ምሳሌዎች፡- 
ሀ) ካርቦሃይድሬት: ለአካላችን ዋነኛ የኃይል ምንጮች ሲሆኑ ኦርጋኒክ ሞለኪውሎችም ናቸው፡፡  ዳቦ፣ እህሎች እና ፍራፍሬዎች በካርቦሃይድሬት የበለፀጉ የምግብ ምሳሌዎች ናቸው። 
ለ) ስብ: ማንኛውም የሰባ አሲድ  ወይም ተመሳሳይ ውህዶች ድብልቅ፣ በብዛት በአእንስሳት ተዋጽኦ  ምግብ ውስጥ የሚገኘው፣ ስብ ይባላል። አይብ፣ ለውዝ እና ቅቤ በስብ የበለፀጉ ምግቦች ምሳሌዎች ናቸው።
""", image: 'assets/images/image101.jpg'),
        CoursePage(description: """በሽታ ተከላካይ ምግቦች 

በቪታሚኖች እና ማዕድናት የበለፀጉ ምግቦች መከላከያ ምግቦች ይባላሉ:: 
ምሳሌዎች፡- 
በስብ የሚሟሟ ቫይታሚን ኤ፣ ዲ፣ ኢ እና ኬ በምሳሌነት ሲጠቀሱ ከእንስሳት ተዋጸኦ አእና ከአሳ ይገኛሉ። እንደ ቫይታሚን ሲ፣ ፎሊክ አሲድ እና ቢ ቪታሚኖች በውሃ ውስጥ የሚሟሟ ቫይታሚኖች በፍራፍሬ፣ አትክልት፣ ጥራጥሬ እና የወተት ምግቦች ውስጥ ይገኛሉ።
""", image: 'assets/images/image102.jpg')
      ]),
  Course(
      title: 'ዶሮና እንቁላል በቤተሰብ ስርዓተ\n ምግብ',
      coverImage: 'assets/images/image106.jpeg',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                """ጤናማ አመጋገብ ለሰውነት አስፈላጊ የሆነውን የተመጣጠነ ምግብ የያዘ ነው፡፡ እነዚህም ፕሮቲን ፣ቫይታሚኖች ፣ ፈሳሽ፣ ፋይበር እና ሃይል  ሰጭ ምግቦችን ይይዛል፡፡
መቀንጨር ማለት ልጆችን በተመጣጠነ ምግብ እጥረት፣ በተደጋጋሚ ለበሽታ በመጋለጥ እና በቂ ያልሆነ የስነ-ልቦና እንክብካቤ  ምክንያት የሚያጋጥማቸው የዕድገት ውስንነት ነው፡፡ መቀንጨር ለአእምሮ እድገት ውስንነት ያጋልጣል፡፡  ይህን ለመከላከል የተመጣጠነ ምግብ መመገብ ያስፈልጋል፡፡
የተመጣጠነ ምግብ ማለት የተለያዩ የምግብ ዓይነቶችን ያካተተ አመጋገብ እና ለጤና አስፈላጊ የሆኑ  ንጥረ ነገሮችን በበቂ መጠን የያዘ ማለት ነው፡፡ ከነዚህ ምግቦች መካከል እንቁላል በቀዳሚነት ይጠቀሳል፡፡
እንቁላል:- የተሟላ ምግብ ነው፡፡
- እንቁላል በብዙ ንጥረ ነገሮች የበለፀገ ነው።
- እንቁላል በጣም ከፍተኛ የፕሮቲን ምንጭ ነው
- እንቁላል መመገብ የኮሌስትሮል ደረጃን ያሻሽላል
- እንቁላል ትልቅ የቫይታሚን ዲ ምንጭ ነው
- እንቁላል መመገብ ክብደትን ለማስተካከል ይረዳል
- እንቁላል የምግቦች ሁሉ ራስ ነው፡፡
የዶሮ ስጋ ግንባር ቀደም ከሆኑ የፕሮቲን ምንጮች አንዱ ነው።
- ክብደት ለመቀነስ ይረዳል፡፡
- በቪታሚኖች እና ማዕድናት የበለፀገ ነው
- የፀረ-ካንሰር ምግብ ነው፡፡
- ኮሌስትሮል ለመቀነስ ይረዳል፡፡
- የደም ግፊትን ለመቆጣጠር ይጠቅማል፡፡
- ለጤናማ ቆዳ አስፈላጊ ነው። 
- ተፈጥሯዊ ፀረ-ጭንቀት መድሀኒት ነው፡
""",
            image: 'assets/images/image106.jpeg')
      ]),
  Course(
      title: 'የጨው፡ የስኳር እና የቅባት መጠን\n ስለመወሰን',
      coverImage: 'assets/images/image156.png',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                'ብዙ ጥናቶች የስኳርን አሉታዊ ተጽእኖዎች ያሳያሉ:: በስኳር የተሞላ አመጋገብ እንደ የስኳር በሽታ, ካንሰር እና የልብ ሕመም የመሳሰሉ የጤና ችግሮች ሊያስከትል ይችላል::',
            image: 'assets/images/image35.png'),
        CoursePage(
            description:
                """በየቀኑ የምንመገበውን ስኳር፡ ጨው እና የቅባት መጠንን በተመለከተ ከፍተኛ ጥንቃቄ ያስፈልጋል፡፡
ምግባችንን አብስለን መመገብ ያለብን ለምን እንደሆነ ታውቃላችሁ?
ምክያቱም ምግባችን ሲበስል የተለያዩ በሽታ አምጭ ህዋሳት ይሞታሉ፡፡
ነገር ግን ሁሉም ምግቦች የግድ መበሰል የለባቸውም፡፡  በምግባችን ውስጥ የምንጠቀማቸውን ስኳር፡ ጨው እና ቅባት መመጠን አለብን፡፡
""",
            image: 'assets/images/image36.png')
      ]),
  Course(
      title: 'በምግብ ዝግጅት ጊዜ የሚደረግ\n የግልና የአካባቢ ንጽህና መቸ ነው\n መታጣብ ያለብን',
      coverImage: 'assets/images/img_11.png',
      description: '',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                'የልጅዎን ዳይፐር ከቀየሩ በኋላ የህጻናትን ሰገራ ከጠረጉና ከመጸዳጃ ቤት ከተመለሱ በኋላ እጅወን በዉሃና በሳሙና ይታጠቡ \n\n ምግብ ከማዘጋጀትወ በፊት ህጻናትን ከመመገብወ በፊትና ምግብ ከተመገቡ በኋላ እጅወን በዉሃና በሳሙና ይታጠቡ፡፡',
            image: 'assets/images/img_12.png'),
        CoursePage(
            description:
                'ለመፀዳዳት በተቆፈረ ሽንት ቤት ይጠቀሙ፡፡ ሜዳ ወይም ጓሮ ላይ አይጠቀሙ፡፡ ሜዳ ወይም ጓሮ ላይ መፀዳዳት ለበሽታ አምጭ ተሃዋስያን(ጀርሞች) ያጋልጣል፡፡	 \n\n ጀርሞች በዝንብ፤ ባልታጠበ እጅ፤ በቆሻሻ ዉሃና በሰብል ንክኪ አማካኝነት ይተላለፋሉ፡፡  \n\n እነዚህ ጀርሞች ወደ ምግባችን ሊገቡ ይችላሉ፡፡ ይህ እንዳይሆን እጅን መታጠብ፡ ምግብን መክደንና ዉሃን ማከም ያስፈልጋል፡፡ \n\n ህጻናትን ከተቅማጥና ከሌሎች በሽታወች ለመከላከል መግባቸዉንና የመጫወቻ ቦታቸዉን በንጽህና መያስ አለብን፡፡ ',
            image: 'assets/images/img_13.png'),
        CoursePage(
            description: 'የሚጠጣ ዉሃ ጀርሞች እንዳይገቡበት ክፍት መተዉ የለበትም፡፡ ',
            image: 'assets/images/img_14.png'),
        CoursePage(
            description: 'ብክለትን ለመከላከል የሚጠጣ ውሃ አንደዚህ መክደን ይኖርበታል',
            image: 'assets/images/img_15.png'),
        CoursePage(
            description: 'የሚጠጣ ዉሃን በዉሃ አጋር በማከም ወይም አፍልተን በማቀዝቀዝ መጠጣት አለብን፡፡ ',
            image: 'assets/images/img_16.png'),
        CoursePage(
            description:
                'እጅወን ከታች በምስሉ እንደሚታየዉ ለብ ባለ ዉሃና በሳሙና መታጠብ ከዛም በነፋስ ወይም በንፁህ ፎጣ ማድረቅ፡፡',
            image: 'assets/images/img_17.png')
      ]),
  Course(
      title: 'አሰባጥሮ ስለመመገብ',
      coverImage: 'assets/images/img_18.png',
      description: 'የምግብ አይነቶች፤ የእንስሳት ተዋፅኦ',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(
            description:
                'የእንስሳት ተዋፅኦ ምግቦች ለሰዉዉታችን ገምቢ ሲሆኑ ለእድገትና ለጥንካሬ ምንጭ ናቸዉ፡፡ ከህጻንነት እስከ አዋቂነት የምናደርገዉ እድገት በእነዚህ ምግቦች አማካኝነት ነዉ፡፡ ',
            image: 'assets/images/img_19.png'),
        CoursePage(description: 'ቅባትና ዘይቶች', image: 'assets/images/img_20.png'),
        CoursePage(description: '', image: 'assets/images/img_21.png'),
        CoursePage(description: '', image: 'assets/images/img_22.png'),
        CoursePage(description: '', image: 'assets/images/img_23.png'),
        CoursePage(description: '', image: 'assets/images/img_24.png')
      ]),
  Course(
      title: 'የአናቶች የህጻናትና የታዳጊ ልጆች\n አመጋገብ',
      coverImage: 'assets/images/img_25.png',
      description: 'የአናቶች ስርዓተ ምግብ',
      pages: [
        CoursePage(description: 'አዘጋጆች፡ ቁምላቸው ገረመው እና ታደለ ደሴ (ዶ/ር)', image: ''),
        CoursePage(description: '', image: 'assets/images/img_26.png'),
        CoursePage(
            description:
                'ነብሰ ጡር እናት በባለቤቷ እገዛ የተመጣጠነ ምግብ እንድትመገብ ሲደረግ አባወራዉ ባለቤቱ ባረገዘች ጊዜ የተመጣጠነ ምግብ መመገቧን ማረጋገጥ አለበት፡፡ ',
            image: 'assets/images/img_27.png'),
        CoursePage(
            description:
                'የሚያጠቡ አናቶች የተመጣጠነ ምግብ መመገብ አለባቸው ይህም ለራሳቸውና ለሚያጠቡት ህጻን በጣም አስፈላጊ ነው',
            image: 'assets/images/img_28.png'),
        CoursePage(
            description: 'ከ6 ወር በታች ለሆኑ ህጻናት ተጨማሪ ምግብ መመገብ ለበሽታ ያጋልጣል',
            image: 'assets/images/img_29.png'),
        CoursePage(
            description: 'ህጻኑ 6 ወር አስኪሞላውድረስ የእናትጡት ብቻ ያጥቡት',
            image: 'assets/images/img_30.png'),
        CoursePage(
            description: 'ከ፮ ወር በኃላ ህጻናት ተጨማሪ ምግብ መመገብ',
            image: 'assets/images/img_31.png'),
        CoursePage(
            description:
                'አባቶች ለሚስቶቻቸው አንቁላል፥ ወተት፥ አትክልትና ፍራፍሬ በማቅረብ ህጻናት አንዲመገቡ ሲያደርጉ \n\n ለህጻናት ከተለያዪ የእህል አይነት የተቀላቀለ ገንፎ በመስራት አመጣጥኖ መመገብ ያስፈልጋል',
            image: 'assets/images/img_32.png'),
        CoursePage(
            description:
                'የህጻናት ምግብ ከማብሰላችንና ከመመገባችን በፊት አቃወችንና አጃችንን በውሃና በሳሙና መታጠብ አለብን',
            image: 'assets/images/img_33.png'),
        CoursePage(
            description:
                'ልጆቻንን ጡት ካጠባን በሓላ በመካከሉ ፍራፍሬ የላመ የአትክልት ገንፎ ወይም የ በሰለ መመገብ አለብን',
            image: 'assets/images/img_34.png'),
        CoursePage(
            description:
                'ልጅወን በፍቅር፥ በትዕግስትና በእርጋታ ይመግቡ፥፥ በዚህ አይነት የተመገበ ህጻን ምግቡን በመጨረስ ጤናማ አድገት ይኖረዋል',
            image: 'assets/images/img_35.png')
      ])
];
